import math


def area(r):
    """
    Возвращает площадь круга с радиусом r
    
    Параметры:
    r (int, float): Радиус круга
    
    Возвращаемое значение:
    int, float: Площадь круга (math.pi*r*r)

    Пример вызова:
    >>> area(3)
    28.274333882308138
    
    """
    
    return math.pi * r * r


def perimeter(r):
    """
    Возвращает длину окружности радиуса r

    Параметры:
    r (int, float): Радиус круга

    Возвращаемое значение:
    int, float: длина окружности (2*math.pi*r)

    Пример вызова:
    >>> perimeter(3)
    18.84955592153876
    """
    return 2 * math.pi * r
