
def area(a):
    """
    Возвращает площадь квадрата со стороной a

    Параметры:
    a (int, float): сторона квадрата

    Возвращаемое значение:
    int, float: Площадь квадрата (a*a)

    Пример вызова:
    >>> area(16)
    256
    
    """
    return a * a


def perimeter(a):
    """
    Возвращает периметр квадарата со стороной а

    Параметры:
    a (int,float): сторона квадрата

    Возвращаемое значение:
    int,float: периметр квадрата (4*a)

    Пример вызова:
    >>> perimeter(16)
    64
    """
    return 4 * a
